using System;
using System.Collections.Generic;
using System.Text;

namespace Self_StudyNavigator
{
    /*
     Домашнее задание

     Создайте абстрактный класс Человек, пусть там будет свойство Имя и абстрактный метод СказатьПриветствие(), 
    от этого класса будет несколько наследников, которые представляют национальность (русский, украинец, американец...). 
    Должно получиться так, что при вызове метода СказатьПриветствие() выводилось приветствие на языке соответствующему 
    национальности (Привет, Привіт, Hi...).

     */

    class Task17
    {
    }
}
